# SQL Challenge 
Description:
- You have data about an e-commerce site
- The 'order_details' table contains details about the order such as purchased items, amounts, and price.
Run the queries below to see a sample of each dataset

## Identifying Frequently Purchased Sub-Category 

##### Write a query to find pairs of sub-categories that are frequently bought together in the same order. For each pair, provide the sub-categories and the number of times they were purchased together. Ensure the pairs are unique (i.e., "A-B" is considered the same as "B-A").

In [30]:
import sqlite3
import pandas as pd

In [31]:
query = '''
SELECT * from order_details LIMIT 10
'''

In [32]:
with sqlite3.connect('data/mydatabase.db') as conn:
    df = pd.read_sql_query(query, conn)

df

  order_id  amount  profit  quantity     category      sub_category
0  B-25601  1275.0 -1148.0         7    Furniture         Bookcases
1  B-25601    66.0   -12.0         5     Clothing             Stole
2  B-25601     8.0    -2.0         3     Clothing       Hankerchief
3  B-25601    80.0   -56.0         4  Electronics  Electronic Games
4  B-25602   168.0  -111.0         2  Electronics            Phones
5  B-25602   424.0  -272.0         5  Electronics            Phones
6  B-25602  2617.0  1151.0         4  Electronics            Phones
7  B-25602   561.0   212.0         3     Clothing             Saree
8  B-25602   119.0    -5.0         8     Clothing             Saree
9  B-25603  1355.0   -60.0         5     Clothing          Trousers

In [47]:
# Write a query to find pairs of sub-categories that are 
# frequently bought together in the same order

query = """
    WITH pair_table AS (SELECT od.order_id,
    CASE 
        WHEN od.sub_category < od_2.sub_category
            THEN od.sub_category || ' ' || od_2.sub_category
        ELSE od_2.sub_category || ' ' || od.sub_category
    END pairs
    FROM order_details AS od
    JOIN order_details AS od_2 ON od.order_id = od_2.order_id
    WHERE od.sub_category != od_2.sub_category)
    SELECT pairs, COUNT(pairs) AS total_pairs
    FROM pair_table
    GROUP BY pairs
    ORDER BY total_pairs DESC
    
"""

with sqlite3.connect('data/mydatabase.db') as conn:
    df = pd.read_sql_query(query, conn)

df

                 pairs  total_pairs
0    Hankerchief Stole          242
1    Hankerchief Saree          220
2          Saree Stole          218
3         Phones Saree          106
4          Saree Skirt           96
..                 ...          ...
131       Skirt Tables            4
132      Phones Tables            4
133    Leggings Tables            4
134   Bookcases Tables            4
135       Kurti Tables            2

[136 rows x 2 columns]